Catalogs/упЦветовыеСхемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упЦветовыеСхемы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляОтображенияМаршрута</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильВыбранногоМаркера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтилиМаркеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильВыделенногоМаркера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтилиМаркеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильЛинии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтилиЛиний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильМаркера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтилиМаркеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/упКартинкиМаркеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упКартинкиМаркеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыбратьИзФайла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПоУмолчанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерГолубой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерЖелтый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерЗеленый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерКрасный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерСиний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерФиолетовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойБелый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойГолубой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЖелтый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЗеленый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойКрасный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойОранжевый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойРозовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойСерый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойСиний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойФиолетовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЧерный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПоУмолчаниюВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерГолубойВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерЖелтыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерЗеленыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерКрасныйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерСинийВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерФиолетовыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойБелыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойГолубойВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЖелтыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЗеленыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойКрасныйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойОранжевыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойРозовыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойСерыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойСинийВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойФиолетовыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЧерныйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПоУмолчаниюВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерГолубойВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерЖелтыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерЗеленыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерКрасныйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерСинийВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерФиолетовыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойБелыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойГолубойВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЖелтыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЗеленыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойКрасныйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойОранжевыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойРозовыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойСерыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойСинийВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойФиолетовыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЧерныйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПрибытиеВТочкуМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерНачалоРаботВТочкеМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерУбытиеСТочкиМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерСообщениеДиспетчеру</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерСообщениеОтДиспетчера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерИсходящийЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерВходящийЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерТочкаПропущена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранспортноеСредство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобытиеМониторинга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерИзменениеСледующейТочкиПоМаршруту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерОтсутствиеЛицензииНаПодключение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КроссДокинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Магазин</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Склад</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упЦветовыеСхемы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс
	
// Процедура производит первоначальное заполнение справочника.
//
Процедура СформироватьЦветовыеСхемыПоУмолчанию() Экспорт
	
	// синяя		
	СиняяЛиния = Справочники.упСтилиЛиний.НайтиПоРеквизиту("Цвет", "#0000FF");
	Если Не СиняяЛиния.Пустая() Тогда
		Если Справочники.упЦветовыеСхемы.НайтиПоРеквизиту("СтильЛинии", СиняяЛиния).Пустая() Тогда
			НовыйЭлемент = Справочники.упЦветовыеСхемы.СоздатьЭлемент();
			НовыйЭлемент.Наименование                       = НСтр("ru = 'Синяя'");
			НовыйЭлемент.ИспользоватьДляОтображенияМаршрута = Истина;
			НовыйЭлемент.СтильЛинии                         = СиняяЛиния;
			НовыйЭлемент.СтильМаркера                       = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойСиний);
			НовыйЭлемент.СтильВыделенногоМаркера            = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойСинийВыделенный);
			НовыйЭлемент.СтильВыбранногоМаркера             = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойСинийВыбранный);
			Попытка
				НовыйЭлемент.Записать();
			Исключение                                                                                                                                                                                                                                                                                                                                                                                                                                                
				ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Если Не ЗначениеЗаполнено(ТекстСообщения) Тогда 
					ТекстСообщения = ОписаниеОшибки();
				КонецЕсли;
				ЗаписьЖурналаРегистрации("Создание простой цветовой схемы", УровеньЖурналаРегистрации.Предупреждение, Метаданные.Справочники.упЦветовыеСхемы,, ТекстСообщения);
			КонецПопытки; 
			
		КонецЕсли;
	КонецЕсли;
	
	// белая		
	БелаяЛиния = Справочники.упСтилиЛиний.НайтиПоРеквизиту("Цвет", "#FFFFFF");
	Если Не БелаяЛиния.Пустая() Тогда
		Если Справочники.упЦветовыеСхемы.НайтиПоРеквизиту("СтильЛинии", БелаяЛиния).Пустая() Тогда
			НовыйЭлемент = Справочники.упЦветовыеСхемы.СоздатьЭлемент();
			НовыйЭлемент.Наименование                       = НСтр("ru = 'Белая'");
			НовыйЭлемент.ИспользоватьДляОтображенияМаршрута = Истина;
			НовыйЭлемент.СтильЛинии                         = БелаяЛиния;
			НовыйЭлемент.СтильМаркера                       = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойБелый);
			НовыйЭлемент.СтильВыделенногоМаркера            = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойБелыйВыделенный);
			НовыйЭлемент.СтильВыбранногоМаркера             = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойБелыйВыбранный);
			Попытка
				НовыйЭлемент.Записать();
			Исключение                                                                                                                                                                                                                                                                                                                                                                                                                                                
				ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Если Не ЗначениеЗаполнено(ТекстСообщения) Тогда 
					ТекстСообщения = ОписаниеОшибки();
				КонецЕсли;
				ЗаписьЖурналаРегистрации("Создание простой цветовой схемы", УровеньЖурналаРегистрации.Предупреждение, Метаданные.Справочники.упЦветовыеСхемы,, ТекстСообщения);
			КонецПопытки; 
		КонецЕсли;
	КонецЕсли;
	
	// голубая		
	ГолубаяЛиния = Справочники.упСтилиЛиний.НайтиПоРеквизиту("Цвет", "#00FFFF");
	Если Не ГолубаяЛиния.Пустая() Тогда
		Если Справочники.упЦветовыеСхемы.НайтиПоРеквизиту("СтильЛинии", ГолубаяЛиния).Пустая() Тогда
			НовыйЭлемент = Справочники.упЦветовыеСхемы.СоздатьЭлемент();
			НовыйЭлемент.Наименование                       = НСтр("ru = 'Голубая'");
			НовыйЭлемент.ИспользоватьДляОтображенияМаршрута = Истина;
			НовыйЭлемент.СтильЛинии                         = ГолубаяЛиния;
			НовыйЭлемент.СтильМаркера                       = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойГолубой);
			НовыйЭлемент.СтильВыделенногоМаркера            = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойГолубойВыделенный);
			НовыйЭлемент.СтильВыбранногоМаркера             = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойГолубойВыбранный);
			Попытка
				НовыйЭлемент.Записать();
			Исключение                                                                                                                                                                                                                                                                                                                                                                                                                                                
				ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Если Не ЗначениеЗаполнено(ТекстСообщения) Тогда 
					ТекстСообщения = ОписаниеОшибки();
				КонецЕсли;
				ЗаписьЖурналаРегистрации("Создание простой цветовой схемы", УровеньЖурналаРегистрации.Предупреждение, Метаданные.Справочники.упЦветовыеСхемы,, ТекстСообщения);
			КонецПопытки; 
		КонецЕсли;
	КонецЕсли;
	
	// желтая		
	ЖелтаяЛиния = Справочники.упСтилиЛиний.НайтиПоРеквизиту("Цвет", "#FFFF00");
	Если Не ЖелтаяЛиния.Пустая() Тогда
		Если Справочники.упЦветовыеСхемы.НайтиПоРеквизиту("СтильЛинии", ЖелтаяЛиния).Пустая() Тогда
			НовыйЭлемент = Справочники.упЦветовыеСхемы.СоздатьЭлемент();
			НовыйЭлемент.Наименование                       = НСтр("ru = 'Желтая'");
			НовыйЭлемент.ИспользоватьДляОтображенияМаршрута = Истина;
			НовыйЭлемент.СтильЛинии                         = ЖелтаяЛиния;
			НовыйЭлемент.СтильМаркера                       = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойЖелтый);
			НовыйЭлемент.СтильВыделенногоМаркера            = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойЖелтыйВыделенный);
			НовыйЭлемент.СтильВыбранногоМаркера             = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойЖелтыйВыбранный);
			Попытка
				НовыйЭлемент.Записать();
			Исключение                                                                                                                                                                                                                                                                                                                                                                                                                                                
				ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Если Не ЗначениеЗаполнено(ТекстСообщения) Тогда 
					ТекстСообщения = ОписаниеОшибки();
				КонецЕсли;
				ЗаписьЖурналаРегистрации("Создание простой цветовой схемы", УровеньЖурналаРегистрации.Предупреждение, Метаданные.Справочники.упЦветовыеСхемы,, ТекстСообщения);
			КонецПопытки; 
		КонецЕсли;
	КонецЕсли;
	
	// зеленая		
	ЗеленаяЛиния = Справочники.упСтилиЛиний.НайтиПоРеквизиту("Цвет", "#00FF00");
	Если Не ЗеленаяЛиния.Пустая() Тогда
		Если Справочники.упЦветовыеСхемы.НайтиПоРеквизиту("СтильЛинии", ЗеленаяЛиния).Пустая() Тогда
			НовыйЭлемент = Справочники.упЦветовыеСхемы.СоздатьЭлемент();
			НовыйЭлемент.Наименование                       = НСтр("ru = 'Зеленая'");
			НовыйЭлемент.ИспользоватьДляОтображенияМаршрута = Истина;
			НовыйЭлемент.СтильЛинии                         = ЗеленаяЛиния;
			НовыйЭлемент.СтильМаркера                       = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойЗеленый);
			НовыйЭлемент.СтильВыделенногоМаркера            = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойЗеленыйВыделенный);
			НовыйЭлемент.СтильВыбранногоМаркера             = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойЗеленыйВыбранный);
			Попытка
				НовыйЭлемент.Записать();
			Исключение                                                                                                                                                                                                                                                                                                                                                                                                                                                
				ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Если Не ЗначениеЗаполнено(ТекстСообщения) Тогда 
					ТекстСообщения = ОписаниеОшибки();
				КонецЕсли;
				ЗаписьЖурналаРегистрации("Создание простой цветовой схемы", УровеньЖурналаРегистрации.Предупреждение, Метаданные.Справочники.упЦветовыеСхемы,, ТекстСообщения);
			КонецПопытки; 
		КонецЕсли;
	КонецЕсли;
	
	// красная
	КраснаяЛиния = Справочники.упСтилиЛиний.НайтиПоРеквизиту("Цвет", "#FF0000");
	Если Не КраснаяЛиния.Пустая() Тогда
		Если Справочники.упЦветовыеСхемы.НайтиПоРеквизиту("СтильЛинии", КраснаяЛиния).Пустая() Тогда
			НовыйЭлемент = Справочники.упЦветовыеСхемы.СоздатьЭлемент();
			НовыйЭлемент.Наименование                       = НСтр("ru = 'Красная'");
			НовыйЭлемент.ИспользоватьДляОтображенияМаршрута = Истина;
			НовыйЭлемент.СтильЛинии                         = КраснаяЛиния;
			НовыйЭлемент.СтильМаркера                       = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойКрасный);
			НовыйЭлемент.СтильВыделенногоМаркера            = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойКрасныйВыделенный);
			НовыйЭлемент.СтильВыбранногоМаркера             = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойКрасныйВыбранный);
			Попытка
				НовыйЭлемент.Записать();
			Исключение                                                                                                                                                                                                                                                                                                                                                                                                                                                
				ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Если Не ЗначениеЗаполнено(ТекстСообщения) Тогда 
					ТекстСообщения = ОписаниеОшибки();
				КонецЕсли;
				ЗаписьЖурналаРегистрации("Создание простой цветовой схемы", УровеньЖурналаРегистрации.Предупреждение, Метаданные.Справочники.упЦветовыеСхемы,, ТекстСообщения);
			КонецПопытки; 
		КонецЕсли;
	КонецЕсли;
	
	// оранжевая
	ОранжеваяЛиния = Справочники.упСтилиЛиний.НайтиПоРеквизиту("Цвет", "#FFA500");
	Если Не ОранжеваяЛиния.Пустая() Тогда
		Если Справочники.упЦветовыеСхемы.НайтиПоРеквизиту("СтильЛинии", ОранжеваяЛиния).Пустая() Тогда
			НовыйЭлемент = Справочники.упЦветовыеСхемы.СоздатьЭлемент();
			НовыйЭлемент.Наименование                       = НСтр("ru = 'Оранжевая'");
			НовыйЭлемент.ИспользоватьДляОтображенияМаршрута = Истина;
			НовыйЭлемент.СтильЛинии                         = ОранжеваяЛиния;
			НовыйЭлемент.СтильМаркера                       = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойОранжевый);
			НовыйЭлемент.СтильВыделенногоМаркера            = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойОранжевыйВыделенный);
			НовыйЭлемент.СтильВыбранногоМаркера             = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойОранжевыйВыбранный);
			Попытка
				НовыйЭлемент.Записать();
			Исключение                                                                                                                                                                                                                                                                                                                                                                                                                                                
				ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Если Не ЗначениеЗаполнено(ТекстСообщения) Тогда 
					ТекстСообщения = ОписаниеОшибки();
				КонецЕсли;
				ЗаписьЖурналаРегистрации("Создание простой цветовой схемы", УровеньЖурналаРегистрации.Предупреждение, Метаданные.Справочники.упЦветовыеСхемы,, ТекстСообщения);
			КонецПопытки; 
		КонецЕсли;
	КонецЕсли;
	
	// розовая
	РозоваяЛиния = Справочники.упСтилиЛиний.НайтиПоРеквизиту("Цвет", "#FFC0CB");
	Если Не РозоваяЛиния.Пустая() Тогда
		Если Справочники.упЦветовыеСхемы.НайтиПоРеквизиту("СтильЛинии", РозоваяЛиния).Пустая() Тогда
			НовыйЭлемент = Справочники.упЦветовыеСхемы.СоздатьЭлемент();
			НовыйЭлемент.Наименование                       = НСтр("ru = 'Розовая'");
			НовыйЭлемент.ИспользоватьДляОтображенияМаршрута = Истина;
			НовыйЭлемент.СтильЛинии                         = РозоваяЛиния;
			НовыйЭлемент.СтильМаркера                       = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойРозовый);
			НовыйЭлемент.СтильВыделенногоМаркера            = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойРозовыйВыделенный);
			НовыйЭлемент.СтильВыбранногоМаркера             = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойРозовыйВыбранный);
			Попытка
				НовыйЭлемент.Записать();
			Исключение                                                                                                                                                                                                                                                                                                                                                                                                                                                
				ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Если Не ЗначениеЗаполнено(ТекстСообщения) Тогда 
					ТекстСообщения = ОписаниеОшибки();
				КонецЕсли;
				ЗаписьЖурналаРегистрации("Создание простой цветовой схемы", УровеньЖурналаРегистрации.Предупреждение, Метаданные.Справочники.упЦветовыеСхемы,, ТекстСообщения);
			КонецПопытки; 
		КонецЕсли;
	КонецЕсли;
	
	// серая
	СераяЛиния = Справочники.упСтилиЛиний.НайтиПоРеквизиту("Цвет", "#BEBEBE");
	Если Не СераяЛиния.Пустая() Тогда
		Если Справочники.упЦветовыеСхемы.НайтиПоРеквизиту("СтильЛинии", СераяЛиния).Пустая() Тогда
			НовыйЭлемент = Справочники.упЦветовыеСхемы.СоздатьЭлемент();
			НовыйЭлемент.Наименование                       = НСтр("ru = 'Серая'");
			НовыйЭлемент.ИспользоватьДляОтображенияМаршрута = Истина;
			НовыйЭлемент.СтильЛинии                         = СераяЛиния;
			НовыйЭлемент.СтильМаркера                       = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойСерый);
			НовыйЭлемент.СтильВыделенногоМаркера            = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойСерыйВыделенный);
			НовыйЭлемент.СтильВыбранногоМаркера             = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойСерыйВыбранный);
			Попытка
				НовыйЭлемент.Записать();
			Исключение                                                                                                                                                                                                                                                                                                                                                                                                                                                
				ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Если Не ЗначениеЗаполнено(ТекстСообщения) Тогда 
					ТекстСообщения = ОписаниеОшибки();
				КонецЕсли;
				ЗаписьЖурналаРегистрации("Создание простой цветовой схемы", УровеньЖурналаРегистрации.Предупреждение, Метаданные.Справочники.упЦветовыеСхемы,, ТекстСообщения);
			КонецПопытки; 
		КонецЕсли;
	КонецЕсли;
	
	// фиолетовая
	ФиолетоваяЛиния = Справочники.упСтилиЛиний.НайтиПоРеквизиту("Цвет", "#EE82EE");
	Если Не ФиолетоваяЛиния.Пустая() Тогда
		Если Справочники.упЦветовыеСхемы.НайтиПоРеквизиту("СтильЛинии", ФиолетоваяЛиния).Пустая() Тогда
			НовыйЭлемент = Справочники.упЦветовыеСхемы.СоздатьЭлемент();
			НовыйЭлемент.Наименование                       = НСтр("ru = 'Фиолетовая'");
			НовыйЭлемент.ИспользоватьДляОтображенияМаршрута = Истина;
			НовыйЭлемент.СтильЛинии                         = ФиолетоваяЛиния;
			НовыйЭлемент.СтильМаркера                       = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойФиолетовый);
			НовыйЭлемент.СтильВыделенногоМаркера            = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойФиолетовыйВыделенный);
			НовыйЭлемент.СтильВыбранногоМаркера             = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойФиолетовыйВыбранный);
			Попытка
				НовыйЭлемент.Записать();
			Исключение                                                                                                                                                                                                                                                                                                                                                                                                                                                
				ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Если Не ЗначениеЗаполнено(ТекстСообщения) Тогда 
					ТекстСообщения = ОписаниеОшибки();
				КонецЕсли;
				ЗаписьЖурналаРегистрации("Создание простой цветовой схемы", УровеньЖурналаРегистрации.Предупреждение, Метаданные.Справочники.упЦветовыеСхемы,, ТекстСообщения);
			КонецПопытки; 
		КонецЕсли;
	КонецЕсли;
	
	// черная
	ЧернаяЛиния = Справочники.упСтилиЛиний.НайтиПоРеквизиту("Цвет", "#000000");
	Если Не ЧернаяЛиния.Пустая() Тогда
		Если Справочники.упЦветовыеСхемы.НайтиПоРеквизиту("СтильЛинии", ЧернаяЛиния).Пустая() Тогда
			НовыйЭлемент = Справочники.упЦветовыеСхемы.СоздатьЭлемент();
			НовыйЭлемент.Наименование                       = НСтр("ru = 'Черная'");
			НовыйЭлемент.ИспользоватьДляОтображенияМаршрута = Истина;
			НовыйЭлемент.СтильЛинии                         = ЧернаяЛиния;
			НовыйЭлемент.СтильМаркера                       = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойЧерный);
			НовыйЭлемент.СтильВыделенногоМаркера            = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойЧерныйВыделенный);
			НовыйЭлемент.СтильВыбранногоМаркера             = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойЧерныйВыбранный);
			Попытка
				НовыйЭлемент.Записать();
			Исключение                                                                                                                                                                                                                                                                                                                                                                                                                                                
				ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Если Не ЗначениеЗаполнено(ТекстСообщения) Тогда 
					ТекстСообщения = ОписаниеОшибки();
				КонецЕсли;
				ЗаписьЖурналаРегистрации("Создание простой цветовой схемы", УровеньЖурналаРегистрации.Предупреждение, Метаданные.Справочники.упЦветовыеСхемы,, ТекстСообщения);
			КонецПопытки; 
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ПервоначальноеЗаполнение()
	
#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции
	
	// Нет.
	
#КонецОбласти
	
#КонецЕсли
